Autodesk.Revit.DB.ColorFillSchemeEntry.CanSetValue(Autodesk.Revit.DB.ElementId)
Checks whether Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType of entry is ElementId.
value:
New ElementId value.
Returns:
True if Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType of the entry is ElementId and the entry, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.CanSetValue(System.Double)
Checks whether Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType of entry is Double and the value is no less than 0.0.
value:
New Double value.
Returns:
True if Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType of the entry is Double and the value is finite, false otherwise.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.CanSetValue(System.Int32)
Checks whether Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType of entry is Integer.
value:
New Integer value.
Returns:
True if Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType of the entry is Integer, false otherwise.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.SetElementIdValue(Autodesk.Revit.DB.ElementId)
Sets new ElementId value of entry.
Remarks:
You should only use this method if the Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType property reports the type of the entry as a ElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The entry has different storage type with ElementId.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.SetDoubleValue(System.Double)
Sets new Double value of entry.
Remarks:
You should only use this method if the Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType property reports the type of the entry as a Double.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The entry has different storage type with Double, or value is not finite.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.SetIntegerValue(System.Int32)
Sets new Integer value of entry.
Remarks:
You should only use this method if the Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType property reports the type of the entry as a Integer.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The entry has different storage type with Integer.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.SetStringValue(System.String)
Sets new String value of entry.
Remarks:
This method should only be used if the Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType property reports the type of the entry as a String.
New value should be not empty and valid for Revit name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The entry has different storage type with String, or the value is empty, or contains forbidden characters.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.GetElementIdValue
Gets the ElementId value stored within the entry.
Remarks:
This method should only be used if the Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType property reports the type of the entry as a ElementId.
Returns:
The ElementId contained in the entry.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.GetDoubleValue
Gets the Double value stored within the entry.
Remarks:
This method should only be used if the Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType property reports the type of the entry as a Double.
Returns:
The Double value contained in the entry.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.GetIntegerValue
Gets the Integer value stored within the entry.
Remarks:
This method should only be used if the Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType property reports the type of the entry as a Integer.
Returns:
The Integer value contained in the entry.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.GetStringValue
Gets the String value stored within the entry.
Remarks:
This method should only be used if the Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType property reports the type of the entry as a String.
Returns:
The String contained in the entry.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ColorFillSchemeEntry.Caption
The text displayed in Autodesk::Revit::DB::ColorFillLegend for this  entry.
Remarks:
This property is only meaningful for by range scheme.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: newCaption is an empty string or contains only whitespace.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.StorageType
The storage type of the value stored in this entry.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.IsVisible
Represents if the element colored based on this entry is visible in views.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.IsInUse
Represents if there exists at least one element colored based on this entry in the document.
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.FillPatternId
The id of fill pattern element of this entry.
Remarks:
InvalidElementid represents no pattern, that means
there would be nothing to be filled for elements colored based on this entry.
Only fill pattern elements whose fill pattern target is drafting is valid for color fill scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.Color
The filling color of this entry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry.#ctor(Autodesk.Revit.DB.StorageType)
Creates new ColorFillSchemeEntry.
Remarks:
A new created ColorFillSchemeEntry should be assigned proper value before it is applied to a
Autodesk::Revit::DB::ColorFillScheme. If the Autodesk.Revit.DB.ColorFillSchemeEntry.Color and
Autodesk.Revit.DB.ColorFillSchemeEntry.Caption properties are not set, Revit will generate them automatically
after the ColorFillSchemeEntry is applied to the ColorFillScheme.
storageType:
The type of data that could be stored into this entry.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.ColorFillSchemeEntry
Represents an entry of a Autodesk::Revit::DB::ColorFillScheme.
Since:
2022